[Cues]
Act_E5_5C_DinerPark_BlockedEntrance_Scripted_Max_010="Damn, this is blocked off... now I have to find another way into the diner."
Act_E5_5C_DinerPark_DeadWhale_Look01_Max_010="Look at that... This tornado might be the end of the world... but not if I can change it."
Act_E5_5C_DinerPark_ExplosionLines_Scripted_Max_010="No! No!!!"
Act_E5_5C_DinerPark_ExplosionLines_Scripted_Max_020="This can't happen! I have to stop that fire!"
Act_E5_5C_DinerPark_FireWarn_Scripted_Max_010="Wait, there’s a fire heading this way, I need to do something about it first."
Act_E5_5C_DinerPark_Fire_Look01_Max_010="Come on, Max! Stop that fire!"
Act_E5_5C_DinerPark_HomelessWoman_Look01_Max_010="Oh no... not her... I should have warned her!| I never even asked her name... so selfish."
Act_E5_5C_DinerPark_HomelessWoman_Look01_Max_015="Whoa, she's not here... I hope she's in a shelter... I never even asked her name..."
Act_E5_5C_DinerPark_Newspaper01_Look01_Max_010="Go get 'em, Juliet…"
Act_E5_5C_DinerPark_Newspaper02_Look01_Max_010="The monsters are actually the people here…"
Act_E5_5C_DinerPark_NewspaperDispenser_Look01_Max_010="Bad news…"
Act_E5_5C_DinerPark_ObjectiveLines04_Scripted_Max_010="Oh no... that fire is spreading to the diner! Do something!"
Act_E5_5C_DinerPark_OfficerBerry_Look01_Max_010="Oh no... Officer Berry died before I could help him... It's too late now."
Act_E5_5C_DinerPark_Sand_Look01_Max_010="Please let this sand put out the fire…"
Act_E5_5C_DinerPark_Trucker_Look01_Max_010="Hey, that guy is trapped! I have to help everybody I can."
Act_E5_5C_DinerPark_TwoWhalesBoard_Look01_Max_010="I wish life was back to simple eggs and bacon…"
Act_E5_5C_DinerPark_TwoWhalesNeon_Look01_Max_010="I never thought I'd see the Two Whales look like that…"
Act_E5_5C_DinerPark_WarrenCar_Look01_Max_010="Warren's car is about the only thing left alone... Good."
Act_E5_5C_Diner_Booth_Zen_Max_010="Max, give yourself one moment to do nothing..."
Act_E5_5C_Diner_Booth_Zen_Max_020="This is where I convinced Chloe I could rewind time."
Act_E5_5C_Diner_Booth_Zen_Max_030="So what's the point of this power, what's the lesson..."
Act_E5_5C_Diner_Booth_Zen_Max_040="To keep fixing what I keep fucking up?"
Act_E5_5C_Diner_Booth_Zen_Max_050="No, because I didn't ask for this "gift"..."
Act_E5_5C_Diner_Booth_Zen_Max_060="But I was able to stop Mark Jefferson..."
Act_E5_5C_Diner_Booth_Zen_Max_070="and now I can stop Chloe from dying..."
Act_E5_5C_Diner_Booth_Zen_Max_080="for the last time."
Act_E5_5C_Diner_CHFrank_Look01_Max_010="It's good to have Frank on our team."
Act_E5_5C_Diner_CHFrank_Look01_Max_015="I wish Frank was on our team... He's not a bad guy."
Act_E5_5C_Diner_CHJoyce_Look01_Max_010="Joyce has got everybody's back... even Frank's."
Act_E5_5C_Diner_CHJoyce_Look01_Max_015="Joyce has got everybody's back..."
Act_E5_5C_Diner_CHWarren_Look01_Max_010="Look at Warren... always trying to help."
Act_E5_5C_Diner_CHWarren_Look02_Max_015="At least I kissed Warren once to let him know how I feel..."
Act_E5_5C_Diner_CHWarren_Look02_Max_020="I hope Warren knows how much his friendship means to me."
Act_E5_5C_Diner_CHWarren_Look02_Max_025="I like how Warren just does his thing no matter what."
Act_E5_5C_Diner_CanStock_Look01_Max_010="At least nobody is going to starve in here..."
Act_E5_5C_Diner_DinerIdleLines_Scripted_Max_010="Joyce is the real saint of Arcadia Bay... She's there for everybody..."
Act_E5_5C_Diner_DinerIdleLines_Scripted_Max_020="I wish Joyce was with David now... They both deserve some peace."
Act_E5_5C_Diner_DinerIdleLines_Scripted_Max_030="I love that Warren just does his thing... no matter the odds."
Act_E5_5C_Diner_DinerIdleLines_Scripted_Max_040="It's hard to believe my big choice a few days ago was "waffle or omelette.""
Act_E5_5C_Diner_DinerIdleLines_Scripted_Max_050="I've been through so many lifetimes this week..."
Act_E5_5C_Diner_DinerIdleLines_Scripted_Max_060="Okay, no more thinking, get that photo..."
Act_E5_5C_Diner_FirstAidSupplies_Look01_Max_010="Good job, Warren. I hope those supplies are enough."
Act_E5_5C_Diner_Jukebox_Look01_Max_010="No more music..."
Act_E5_5C_Diner_Menu_Look01_Max_010="It's hard to believe people were eating breakfast here, only a few hours ago."
Act_E5_5C_Diner_NoExitLines_Scripted_Max_010="Max, you can't leave until you see Warren and get that photo."
Act_E5_5C_Diner_ObjectiveLines05_Scripted_Max_010="So glad everybody is safe here, but I need that photo from Warren to help Chloe!"
Act_E5_5C_Diner_Pompidou_Look01_Max_010="At least Frank still has Pompidou at his side."
Act_E5_5C_Diner_VortexFlyer_Look01_Max_010="The party is over. This vortex... is much bigger."
Act_E5_5C_StoreRoom_ArcadiaFlyer_Look01_Max_010="Trust me, I'm trying to figure out how... I swear."
Act_E5_5C_StoreRoom_FisherMan_Look01_Max_010="I want to help that fisherman, but... he's in shock and he might not hear me."
Act_E5_5C_StoreRoom_FisherMan_Look02_Max_020="Oh no..."
Act_E5_5C_StoreRoom_Flyer01_Look01_Max_010="Aw... This makes me so sad."
Act_E5_5C_StoreRoom_FuseBox_Look01_Max_010="Don't fail me, fuse box..."
Act_E5_5C_StoreRoom_Magazine01_Look01_Max_010="If we can make it out of this, Chloe..."
Act_E5_5C_StoreRoom_ObjectiveLines02_Scripted_Max_010="How can I get out of here?"
Act_E5_5C_StoreRoom_ObjectiveLines03_Scripted_Max_010="Okay, I better hurry to the diner over there. I need Warren's photo."
Act_E5_5C_StoreRoom_Sprinkler_Look01_Max_010="Okay. I just need to switch on the electricity to activate the sprinkler."
Act_E5_5C_StoreRoom_StoreLines_Scripted_Max_010="No, I can't cross this way. Is there another way around?"
Act_E5_5C_StoreRoom_StoreRoomFire_Look01_Max_010="Damn, I'm stuck here unless I put out this fire first..."
Act_E5_5C_Street_BrokenTablet_Look01_Max_010="Mystery solved... but nobody gets a reward..."
Act_E5_5C_Street_CHAlyssa_Look01_Max_010="Alyssa is stuck in that house...|I have to get her out fast."
Act_E5_5C_Street_CHEvan_Look01_Max_010="Evan, are you crazy? Get the hell out of here!"
Act_E5_5C_Street_CHEvan_Look02_Max_020="Oh no! No, Evan...|Why didn't I grab you?"
Act_E5_5C_Street_ChildrenDrawing_Look01_Max_010="I... I can't think about all those children out there…"
Act_E5_5C_Street_DeadPerson02_Look01_Max_010="Oh, I can't stand seeing these bodies…"
Act_E5_5C_Street_DeadPerson03_Look01_Max_010="Death is everywhere... following me…"
Act_E5_5C_Street_DerailedTrain_Look01_Max_010="Shit, that train could have derailed into the diner…"
Act_E5_5C_Street_HelpLines_Scripted_Max_010="Shit... Alyssa needs help again!"
Act_E5_5C_Street_HelpLines_Scripted_Max_020="Not Evan... I have to stop him from getting hurt."
Act_E5_5C_Street_HelpLines_Scripted_Max_030="He's dead... electrocuted…"
Act_E5_5C_Street_HelpLines_Scripted_Max_040="I have to get this guy out of here or he'll die."
Act_E5_5C_Street_IdleLines_Scripted_Max_020="You know how to use your power... Do it."
Act_E5_5C_Street_IdleLines_Scripted_Max_030="This storm is... huge. Keep going…"
Act_E5_5C_Street_IdleLines_Scripted_Max_040="I need Warren's photo to save Chloe!"
Act_E5_5C_Street_IdleLines_Scripted_Max_050="There's no way I'm letting Chloe die…"
Act_E5_5C_Street_IdleLines_Scripted_Max_060="But the whole town is dying... am I responsible too?"
Act_E5_5C_Street_IdleLines_Scripted_Max_070="I have to accept that I've changed more than time…"
Act_E5_5C_Street_IdleLines_Scripted_Max_080="Please let Warren and Joyce be okay... Please…"
Act_E5_5C_Street_ObjectiveLines01_Scripted_Max_010="Warren is at the Two Whales diner, so hurry up!"
Act_E5_5C_Street_PanEstateFlyer_Look01_Max_010="Not anymore…"
Act_E5_5C_Street_Plank_Look01_Max_010="Come on, find some way to help Alyssa…"
Act_E5_5C_Street_StormStart_Scripted_Max_010="Look at all those people... all this destruction... Max, you can help!"
Act_E5_5C_Street_WatchmenLogo_Look01_Max_010=""Have A Nice Day"… Sure. But somebody has to save the world."
Cue_E5_5C_Diner_AskPhoto_Max_020="That's okay. The important thing is that you're safe... and I know you can take care of yourself, after Nathan."
Cue_E5_5C_Diner_AskPhoto_Max_050="Warren, I came for all of you. Just tell me you do have the photograph."
Cue_E5_5C_Diner_AskPhoto_Max_070="Now shut up and listen."
Cue_E5_5C_Diner_AskPhoto_Max_110="Thanks for being here. Always."
Cue_E5_5C_Diner_AskPhoto_Warren_010="I hate to say I'm glad to see you, but I'm so glad to see you."
Cue_E5_5C_Diner_AskPhoto_Warren_040="Should have done that a long time ago.|But damn, Max... I can't believe you actually drove down here|in the middle of a fucking E6 tornado, just for one photograph...|I mean, I know you didn't come for me."
Cue_E5_5C_Diner_AskPhoto_Warren_060="I just want…"
Cue_E5_5C_Diner_AskPhoto_Warren_080="Oh yeah, you’re finally going to tell me what you never did in the parking lot…"
Cue_E5_5C_Diner_AskPhoto_Warren_090="Max... I'm sorry you got stuck in this... in this...|I don't have a fucking clue what's going on.|But I have total faith that you'll do the right thing when the time comes.|I'm so proud of you, Max."
Cue_E5_5C_Diner_AskPhoto_Warren_100="How could there be a more important moment in history? And I'm in the middle of it with you? So thank you for trusting me."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_002="That makes two of us. Now, if only I had Pompidou back... and Rachel."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_003="That makes two of us. Now if I only had Rachel back..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_006="Now Max, what about that info I gave you? Did you and Chloe find out what happened to her?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_008="Oh, there's still hope. Look, I need to rest now, I'm wiped out… like Arcadia Bay. I just hope Rachel is far away, laying in the sun, happy… Thanks for trying, Max. So, I guess we just wait for the Lord to lift us up… or not."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_010="What? Besides this tornado, the hole in my leg and the fact my dog is dead...not to mention I could die on the floor of a diner and you're the last person I might see...I'm cool. Jesus."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_011="What? Besides this tornado, the hole in my leg, not to mention the fact that I might die on the floor of a diner and you're the last person I could see… You know what, I'm cool. Jesus."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_012="God, no, please... Please, no... No, not Rachel… She can't fucking be!|Are you… Are you sure? I mean, how do you know?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_013="Fuck you, Max. No. No way. She left town... She's gone...|How do you know, huh? How?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_015="Prescott?|Fuck! Fuck, I knew it!|I should never have hooked up with that sick punk!|Pompidou hated him!|You saw… you saw Rachel?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_016="And I bet that thief Chloe and you didn't find Rachel, right?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_017="And I bet you and Chloe didn't find Rachel, right?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_019="Who gives a fuck now? Just stand over there so I don't have to see before the Lord lifts me up. Please Max."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_022="How? How did he kill her?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_024="An overdose? The only way Nathan could've done that is… is if I sold it to him. I killed my lioness! No..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_025="What have I done?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_027="Where is this motherfucker Jefferson?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_030="Rachel… Oh, God. She was the one good thing in my life, Max. I know she was too young, and... I expected her to leave me, just… just not how it happened. I would never have stopped her from going after her dreams."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_032="I knew Chloe and her... were close... I was jealous..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_034="Rachel cared about a lot of people... especially Chloe..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_035="But, uh... now I see why Rachel dug her... and Chloe was man enough to ask me for help after all that shit we went through."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_037="You know, the one time I met my dad, the bastard quoted the bible and said he wanted to "enter his house justified." In other words, to do the right thing... me too. And maybe you're helping me get there, Max."
Cue_E5_5C_Diner_CHFrank_FrankDial_Frank_038="Don't get me wrong, kid. I still think you're weird... but you're cool."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_001="Frank... I'm so glad you're here..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_004="I'm sorry... We had no time to investigate when the storm started..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_005="Frank, I don’t know how to say this, so... I just will. Rachel is dead."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_007="We used the names you gave us to track down a farmhouse. My professor, Mark Jefferson, has this creepy photo torture room... and we found out he was using Nathan Prescott to drug and photograph Blackwell students."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_009="Frank... I'm so glad you're here... Are you okay?"
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_014="All of our clues led us to my professor, Mark Jefferson... He had this creepy photo torture chamber... and we found out... he was using Nathan Prescott to drug and photograph Blackwell students..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_018="Um, we don't... know. Things got crazy and... and, here we are... Frank, I'm sorry about this."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_020="Yes... I wish I didn't. I'm so, so sorry, Frank. Nathan wanted to impress Jefferson, and he... he killed her."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_021="No, I didn't, but... Nathan wanted to impress Jefferson and I know he... killed her."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_023="He used some drug... and gave her an overdose..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_026="It doesn't matter... She deserves her peace now."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_028="He's dead. He won't be hurting anybody anymore..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_029="He's going to jail. He won't be hurting anybody anymore..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_031="I know... neither would Chloe..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_033="I know. She obviously cared about you, Frank..."
Cue_E5_5C_Diner_CHFrank_FrankDial_Max_036="Chloe would appreciate that..."
Cue_E5_5C_Diner_CHFrank_FrankQuickPhase_Frank_001="Max… I can't believe my Rach… I… I can't talk right now, all right..."
Cue_E5_5C_Diner_CHFrank_FrankQuickPhase_Frank_004="Sorry, Max. Can't talk now. Hopefully we'll get another chance someday..."
Cue_E5_5C_Diner_CHFrank_FrankQuickPhase_Frank_005="Jesus, Max, did you even listen to me? I don't want to see your face before I die."
Cue_E5_5C_Diner_CHFrank_FrankQuickPhase_Max_002="/!\ WARNING /!\ Text not localized : Cue_E5_5C_Diner_CHFrank_FrankQuickPhase_Max_002"
Cue_E5_5C_Diner_CHFrank_FrankQuickPhase_Max_003="/!\ WARNING /!\ Text not localized : Cue_E5_5C_Diner_CHFrank_FrankQuickPhase_Max_003"
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_002="Just when I think I've already been through the ringer...|Where's Chloe?"
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_007="Not in this storm you won't. And you're not going out there, Max. I just have to pray that Chloe... and David... are holed up some place safe."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_008="Oh, thank God... I was torturing myself before you showed up. Oh God, if something happened to Chloe while I ended up stuck at this diner again..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_009="Don't be, honey. It's not like you whipped up this tornado on your own..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_011="You don't have control over any of that.|David is an adult and he has a lot more age and experience under his belt.|Even if he doesn't always show it..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_013="I know you try to see the good side in everybody... and David needs to try that, too. But that's not important now."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_015="With all the shit that's happened this week, I think you're right."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_017="You did the right thing. David overstepped his bounds. I had a suspicion he was taking his private surveillance way too seriously... But he's sorry and I wish he was here right now."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_019="With all the shit going on this week, I think you're right. And look at me, trying to keep my family together... again. Max... did I make a mistake kicking David out?"
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_021="I'm glad David was there for you... but I don't always like his attitude... And honestly, I don't think I can forgive him for hitting Chloe... If it happens once, it could happen again..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_023="I'm used to my life being hard... Chloe had to find out way too early. And I don't think we need David around to keep reminding us... You're right, Max. I think I'm making my choice now."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_024="I'm so happy David was there for you... but I don't always like his attitude either. Sometimes he scares me..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_026="With all the shit going on this week, I think you're right. And look at me, trying to keep my family together... again."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_028="Oh sweetie, thank you. But your parents should be prouder of you. Even David told me how tough he thinks you are... and he doesn't give out many compliments, as you know."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_030="I'm so happy David was there for you. He has a lot of weight on his back from the war, but he truly wants to help people. He even agreed to take a family counseling class, after he hit Chloe."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_031="I'm so happy David was there for you. He has a lot of weight on his back from the war, but he truly wants to help people. He even agreed to take a family counseling class."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_033="Nothing would make me happier than for David and Chloe to make peace, not war. But I don't know what to do anymore... I just… I just want this storm to blow over forever. Maybe it's time we leave Arcadia Bay... if we can..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_035="I know. And yes, he's not William, but that's okay. He's not supposed to be. You reminded me of when he came into my life... I was ready to give up. David's love gave me strength. He even told me I was his hero... And I can't give up loving him. I want him to come back home... I hope I get to tell him that soon."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_038="He better. Like I said, people don't always see the real David Madsen. I hope Chloe does someday..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Joyce_039="I'm so glad to hear you say that, Max... I know he's not always an easy person to defend... Most people only see him at his worst... You've seen him at his best. And that's the man I want in my life."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_001="Joyce, how are you doing?"
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_003="/!\ WARNING /!\ Text not localized : Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_003"
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_004="I... I'll find her."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_005="She's... safe, Joyce. She just sent me a text before my phone died."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_006="I'm sorry about all this, Joyce."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_010="Um... I mean, I’m also sorry about everything with David."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_012="Well... I didn't mean to take David's side against you or Chloe..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_014="I know... I just feel like everything that's going on with us is the perfect storm for Arcadia Bay."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_016="I'm sorry I caused so many problems with David and Chloe…"
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_018="I just want our lives to be normal again..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_020="David saved my life... from the storm. He means well, even if he doesn't know how to show it. But this has to be your choice..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_022="I... I understand..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_025="I know it's hard for you and Chloe..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_027="Joyce, you've gone through so much for Chloe and David. If you were my mom... I would be so proud."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_029="David saved my life... from the storm. I saw how much he cares about Chloe, even if he couldn't show it. David needs you more than ever, and I can see why you love him."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_032="I'm sure that was a hard thing for him to do... It shows how much he truly cares about you and Chloe."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_034="David is a real hero, Joyce. I know that all he wants to do is make you happy. I know he would do anything for you... and Chloe."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_036="He does about you. It’s so obvious he needs you in his life..."
Cue_E5_5C_Diner_CHJoyce_JoyceDial_Max_037="David is a real hero. I don't know what he's gone through in war, but I can imagine... and he even showed me how to find my own strength under extreme conditions."
Cue_E5_5C_Diner_CHJoyce_JoyceQuickPhase_Joyce_001="Max, we have to take care of everybody in here now. So let me get back to my... double shift."
Cue_E5_5C_Diner_CHWarren_WarrenDialQuickPhase_Warren_001="Damn, Max... You could've been carrying the world on your shoulders this week..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_001="I wish I would have. So I'm just going to tell you without any explanation. Trust me, okay?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_003="I think that this storm started... everything started... when I found out I could rewind time... There's no way this is just a coincidence, right?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_004="I have to go back in time. Jefferson already ki—|killed Chloe... I can't let that happen... I have to do something, Warren!"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_005="Nathan accidently killed Rachel Amber trying to impress Jefferson... He just needed mental help... Now... they're both dead."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_010="All because... because of me? How?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_013="He used Nathan to get drugs and money for him. Jefferson tied me up and... dosed me with some drug and took sick photos of me... It was so horrible..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_015="But I can still change things. What do you think will happen?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_016="Nathan accidently killed Rachel Amber trying to impress Jefferson... Nathan just needed mental help... Now he's dead... and Jefferson is done."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_018="I had a vision in Jefferson's class of a tornado destroying Arcadia Bay. I went to the bathroom and saw my best friend Chloe get shot by Nathan Prescott...You with me so far?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_020="Then I found out that I could rewind time... And, long story short, Mark Jefferson is insane and dangerous."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_024="Dead. History. Which I need to change fast to make it right again... Is that bad?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_025="Busted. History. Which I need to change fast to make it right again... Is that bad?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_026="You're my friend, Warren. You believe me, right? I… I haven't told anybody else except for Chloe... and... and she can't help me right now..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_027="All this destruction... is my fault?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_028="Warren, I know this all sounds insane... but you're the only other person who I can count on now... I wish we had more time together... Do you believe me?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_032="I just wish I could trust my powers..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_033="Always. I just wish I could trust my powers..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_034="I guess we'll never know if it's magic or science..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Max_035="That makes both of us, Warren..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_002="I always do. You should probably tell me quick..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_006="Max, not only the storm but the eclipse, the birds, the whales... everything!"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_007="Max, going back in time is what caused the storm!"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_008="I'm not a real scientist, even though I play one at school, but|this seems like pure cause and effect, maybe Chaos Theory...|Uh, what happened with Jefferson? Did... Did he hurt you?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_014="Max... I'm so sorry you had to go through all that...|You're the bravest person I've ever known.|Now, I want to kill that son of a bitch!|Where is he?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_019="Where else could I be? Go on!"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_021="Whoa... Is that all?"
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_022="Jesus, Max! I want the whole story, but... I guess we really are out of time."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_023="For every action, there's... there's a reaction... Whenever you reversed or altered time, maybe you caused a chain reaction... even in the environment."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_029="I know I can be a pain in the ass... and… and you've always treated me like a person, not… not a beta nerd. I told you before that I'll always believe you..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_030="Give me a break. You sure the hell didn't give yourself time travel powers..."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_031="Max, of course I believe you. You're the most amazing person I've ever met... and I'm glad you trust me."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_036="Even if it's from a wizard or a wormhole... You're part of something bigger. I don't believe in fate or destiny, but after this week, I realize I don't know shit."
Cue_E5_5C_Diner_CHWarren_WarrenDial_Warren_037="I do know you're here for a reason... and I guess it's up to you to find out why."
Cue_E5_5C_Diner_CHWarren_WarrenMinorChoiceQuickPhase_Warren_001="Max, I wish we had more time together but you have more important things to do now..."
Cue_E5_5C_Diner_CHWarren_WarrenMinorChoiceQuickPhase_Warren_002="Max, you have more important things to do now than talk to your friend..."
Cue_E5_5C_Diner_ChoiceHug_Max_010="I could use a hug before I do this…"
Cue_E5_5C_Diner_ChoiceHug_Max_040="You’re not pathetic. You’re one of my heroes... And I’m going to make the right choices from now on... I swear."
Cue_E5_5C_Diner_ChoiceHug_Warren_020="Me too."
Cue_E5_5C_Diner_ChoiceHug_Warren_030="You better go before I get pathetic and tell you not to."
Cue_E5_5C_Diner_ChoiceHug_Warren_050="That's why you're Super Max."
Cue_E5_5C_Diner_ChoiceKiss_Max_010="For luck."
Cue_E5_5C_Diner_ChoiceKiss_Max_030="I know, Warren…"
Cue_E5_5C_Diner_ChoiceKiss_Max_050="I’m going to make the right choices from now on... I swear."
Cue_E5_5C_Diner_ChoiceKiss_Warren_020="Just in case we don’t get out of this... I wanted to say..."
Cue_E5_5C_Diner_ChoiceKiss_Warren_040="Of course you do."
Cue_E5_5C_Diner_ChoiceKiss_Warren_060="That's why you're Super Max."
Cue_E5_5C_Diner_ChoiceNothing_Max_010="Watch out for Joyce... and Frank."
Cue_E5_5C_Diner_ChoiceNothing_Max_015="Watch out for Joyce... and everybody else."
Cue_E5_5C_Diner_ChoiceNothing_Max_030="I’m going to make the right choices from now on... I swear."
Cue_E5_5C_Diner_ChoiceNothing_Warren_020="I got this, Max. Go on."
Cue_E5_5C_Diner_ChoiceNothing_Warren_040="That's why you're Super Max."
Cue_E5_5C_Diner_Focus_Warren_010="Hey... Be careful out there."
Cue_E5_5C_Diner_FrankDialogIntro_IGE_Joyce_010="Okay, Max, excuse me while I go help this other gentleman."
Cue_E5_5C_Diner_Frank_IGE_Frank_010="Jesus, this is not where I want to die…"
Cue_E5_5C_Diner_Frank_IGE_Frank_020="I was just about to drive to Los Angeles too..."
Cue_E5_5C_Diner_Frank_IGE_Frank_030="As long as I have my Pompidou with me…"
Cue_E5_5C_Diner_Frank_IGE_Frank_035="You know, if only I had my Pompidou with me…"
Cue_E5_5C_Diner_HealFrank_IGE_Frank_020="Goddammit, Joyce!"
Cue_E5_5C_Diner_HealFrank_IGE_Frank_040="No, no, I’m just a pussy… Sorry."
Cue_E5_5C_Diner_HealOldMan_IGE_Joyce_010="Hold on... this might sting..."
Cue_E5_5C_Diner_HealOldMan_IGE_Joyce_030="Sorry, sorry..."
Cue_E5_5C_Diner_HealOldMan_IGE_Joyce_050="We will get out of this, okay?"
Cue_E5_5C_Diner_HealOldMan_IGE_OldMan_020="Ow! Shit!"
Cue_E5_5C_Diner_HealOldMan_IGE_OldMan_040="No, I’m sorry... Thank you..."
Cue_E5_5C_Diner_InsertionDiner_Announcer_020="...evacuation. Once again, this is not a test. This is not a test. An E6 tornado warning has been issued for Arcadia Bay and surrounding counties. The Emergency Broadcast System is now in effect..."
Cue_E5_5C_Diner_InsertionDiner_Frank_040="Pompidou…"
Cue_E5_5C_Diner_InsertionDiner_Frank_045="Pompidou... Good watch doggie..."
Cue_E5_5C_Diner_InsertionDiner_Joyce_030="Shh, Frank..."
Cue_E5_5C_Diner_InsertionDiner_Joyce_060="Max!"
Cue_E5_5C_Diner_InsertionDiner_Joyce_070="Oh Jesus, I am so glad to see you, sweetie! Are you okay?"
Cue_E5_5C_Diner_InsertionDiner_Joyce_090="The Two Whales is barely standing now... I don't know if it’s going to make it through this tornado. Poor Officer Berry and all those people out there..."
Cue_E5_5C_Diner_InsertionDiner_Joyce_110="Okay, get your ass inside... I have to get back to this gentleman on the ground... Warren has been gathering all the first aid..."
Cue_E5_5C_Diner_InsertionDiner_Max_080="Yes. What about you guys?"
Cue_E5_5C_Diner_InsertionDiner_Max_100="I know."
Cue_E5_5C_Diner_InsertionDiner_Max_130="You okay, Warren?"
Cue_E5_5C_Diner_InsertionDiner_Max_150="There’s nothing you could do about it, Warren."
Cue_E5_5C_Diner_InsertionDiner_Warren_050="Max!"
Cue_E5_5C_Diner_InsertionDiner_Warren_120="It’s not much, Joyce. But it’s all we have."
Cue_E5_5C_Diner_InsertionDiner_Warren_140="How the hell did I ignore all those warnings, Max? The snow, the eclipse…"
Cue_E5_5C_Diner_InsertionDiner_Warren_160="I’m so stupid... I should have seen it coming…"
Cue_E5_5C_Diner_JoyceDialogIntro_IGE_Joyce_010="Come on, Max. Let's talk over here and give Frank some resting space."
Cue_E5_5C_Diner_Joyce_IGE_Joyce_010="Please be okay, Chloe... I can’t lose you…"
Cue_E5_5C_Diner_Joyce_IGE_Joyce_020="Max... Do you think this is... the end?"
Cue_E5_5C_Diner_Joyce_IGE_Joyce_030="I can’t seem to escape the Two Whales..."
Cue_E5_5C_Diner_Joyce_IGE_Joyce_040="Come on, Joyce... Focus on the people here..."
Cue_E5_5C_Diner_PolaRewind_Max_010="Action !"
Cue_E5_5C_Diner_PolaRewind_Max_020="Not to me Warren…"
Cue_E5_5C_Diner_PolaRewind_Max_030="Have you been drinking ?..."
Cue_E5_5C_Diner_PolaRewind_Warren_010="I know, I know, I’m a pain in the booty. Just one picture."
Cue_E5_5C_Diner_PolaRewind_Warren_020="Uh…"
Cue_E5_5C_Diner_PolaRewind_Warren_030="Welcome to the end of the world, ladies."
Cue_E5_5C_Street_AlyssaSaved_IGE_Alyssa_020="I am!"
Cue_E5_5C_Street_AlyssaSaved_IGE_Alyssa_030="Here I come!"
Cue_E5_5C_Street_AlyssaSaved_IGE_Max_010="Come on, Alyssa! Take my hand!"
Cue_E5_5C_Street_AlyssaSavesMax_IGE_Alyssa_010="Watch out, Max!"
Cue_E5_5C_Street_AlyssaSavesMax_IGE_Alyssa_030="Now we're even. Be careful out there!"
Cue_E5_5C_Street_AlyssaSavesMax_IGE_Max_020="Damn... that was close. Thank you, Alyssa!"
Cue_E5_5C_Street_AlyssaThanks_IGE_Alyssa_010="You did it, Max!"
Cue_E5_5C_Street_AlyssaThanks_IGE_Alyssa_030="Now I am! We need to get out of here!"
Cue_E5_5C_Street_AlyssaThanks_IGE_Max_020="Are you okay?"
Cue_E5_5C_Street_AlyssaThanks_IGE_Max_040="Alyssa, you go on. I have to help other people."
Cue_E5_5C_Street_AlyssaWarnDies_IGE_Alyssa_020="Fuck that shit, Max! Whenever you show up, I have to get out of the way!"
Cue_E5_5C_Street_AlyssaWarnDies_IGE_Alyssa_030="So just get—"
Cue_E5_5C_Street_AlyssaWarnDies_IGE_Max_010="Alyssa, are you okay? Let me help you down!"
Cue_E5_5C_Street_AlyssaWarnNothing_IGE_Alyssa_020="Yes, yes, please Max! I don’t want to die like this!"
Cue_E5_5C_Street_AlyssaWarnNothing_IGE_Alyssa_030="Find something to get me down!"
Cue_E5_5C_Street_AlyssaWarnNothing_IGE_Max_010="Alyssa, are you okay? Let me help you down!"
Cue_E5_5C_Street_AlysssaHelp_IGE_Alyssa_010="Somebody help me!"
Cue_E5_5C_Street_AlysssaHelp_IGE_Alyssa_020="I’m stuck up here!"
Cue_E5_5C_Street_AlysssaHelp_IGE_Alyssa_030="Goddammit, I need help!"
Cue_E5_5C_Street_AlysssaHelp_IGE_Alyssa_040="Please! Help me get down!"
Cue_E5_5C_Street_AlysssaHelp_IGE_Alyssa_050="Help me get down, Max!"
Cue_E5_5C_Street_EvanSaved_IGE_Evan_010="Robert Capa, eat your heart out!"
Cue_E5_5C_Street_EvanSaved_IGE_Evan_030="Max, there's no way I can pass up these images! Just look at it!"
Cue_E5_5C_Street_EvanSaved_IGE_Evan_050="Okay, if you insist…"
Cue_E5_5C_Street_EvanSaved_IGE_Evan_060="Whoa, Max! You do know things! I'm such an idiot."
Cue_E5_5C_Street_EvanSaved_IGE_Evan_080="Now I better listen to the real "Everyday Hero"... Come with me!"
Cue_E5_5C_Street_EvanSaved_IGE_Evan_100="You better help yourself now, Max... We have to survive this!"
Cue_E5_5C_Street_EvanSaved_IGE_Max_020="Evan, do you see that tornado? Get the hell out of here!"
Cue_E5_5C_Street_EvanSaved_IGE_Max_040="You can't take a picture when you're dead! Now move your ass!"
Cue_E5_5C_Street_EvanSaved_IGE_Max_070="Only if you don't find a safe spot until this blows over, okay?"
Cue_E5_5C_Street_EvanSaved_IGE_Max_090="I have to help somebody else first."
Cue_E5_5C_Street_Evan_IGE_Evan_010="Robert Capa, eat your heart out!"
Cue_E5_5C_Street_Evan_IGE_Evan_020="Best. Shot. Ever."
Cue_E5_5C_Street_Evan_IGE_Evan_030="Come on, baby, one more picture…"
Cue_E5_5C_Street_Evan_IGE_Evan_040="Right into the eye of the storm…"
Cue_E5_5C_Street_Evan_IGE_Evan_050="This will be my masterpiece..."
Cue_E5_5C_Street_FishermanAfraid_IGE_Fisherman_010="Please, please, please, please..."
Cue_E5_5C_Street_FishermanAfraid_IGE_Fisherman_020="No more storms..."
Cue_E5_5C_Street_FishermanAfraid_IGE_Fisherman_030="This can’t be the end…"
Cue_E5_5C_Street_FishermanAfraid_IGE_Fisherman_040="I can’t die in this room... I can’t..."
Cue_E5_5C_Street_FishermanSaved_IGE_Fisherman_020="I need to breathe… I… I need air…"
Cue_E5_5C_Street_FishermanSaved_IGE_Fisherman_040="The whole town is dying…"
Cue_E5_5C_Street_FishermanSaved_IGE_Max_010="Come on, you have to get out of here right now."
Cue_E5_5C_Street_FishermanSaved_IGE_Max_030="You should get out of here!"
Cue_E5_5C_Street_Panic_IGE_Girlfriend_010="Please please please move... please God..."
Cue_E5_5C_Street_Panic_IGE_Girlfriend_020="No, you’re not dead... you’re not..."
Cue_E5_5C_Street_Panic_IGE_Man05_030="Argh, please… Please, get me outta here, please, get me outta here."
Cue_E5_5C_Street_Panic_IGE_Man07_010="This is the end... It’s all over now..."
Cue_E5_5C_Street_Panic_IGE_Woman01_010="I... I can’t believe this is real..."
Cue_E5_5C_Street_Panic_IGE_Woman03_010="What’s happening? WHAT’S HAPPENING??"
Cue_E5_5C_Street_Panic_Man01_020="Look that thing, go !"
Cue_E5_5C_Street_Panic_Man01_030="Get Down !!"
Cue_E5_5C_Street_TruckerHelpClose_IGE_Trucker_010="Hey... You... uh... Matt!"
Cue_E5_5C_Street_TruckerHelpClose_IGE_Trucker_020="Can you please... help me?"
Cue_E5_5C_Street_TruckerHelpClose_IGE_Trucker_030="Please! Don’t leave me here!"
Cue_E5_5C_Street_TruckerHelpFar_IGE_Trucker_010="Hey... is anybody out there?"
Cue_E5_5C_Street_TruckerHelpFar_IGE_Trucker_020="Please somebody... anybody... Help me!"
Cue_E5_5C_Street_TruckerHelpFar_IGE_Trucker_030="I don’t want to die here!"
Cue_E5_5C_Street_TruckerSavedRailroad_IGE_Max_020="Are you okay?"
Cue_E5_5C_Street_TruckerSavedRailroad_IGE_Max_040="You better go now."
Cue_E5_5C_Street_TruckerSavedRailroad_IGE_Max_060="No, thanks. I have to find a friend."
Cue_E5_5C_Street_TruckerSavedRailroad_IGE_Trucker_010="Oh Lordy... Thanks, kid."
Cue_E5_5C_Street_TruckerSavedRailroad_IGE_Trucker_030="Once I get the hell out of here... I was trapped here because I got stuck in this shithole delivering logs after the railroad was closed down..."
Cue_E5_5C_Street_TruckerSavedRailroad_IGE_Trucker_050="And I ain’t never coming back here... You need a lift?"
Cue_E5_5C_Street_TruckerSavedRailroad_IGE_Trucker_070="You go, girl. You go."
Cue_E5_5C_Street_TruckerSaved_IGE_Max_020="Are you okay?"
Cue_E5_5C_Street_TruckerSaved_IGE_Max_040="You better go now."
Cue_E5_5C_Street_TruckerSaved_IGE_Max_060="No, thanks. I have to find a friend."
Cue_E5_5C_Street_TruckerSaved_IGE_Trucker_010="Oh Lordy... Thanks, kid."
Cue_E5_5C_Street_TruckerSaved_IGE_Trucker_030="Once I get the hell out of here... I been hauling loads for way too long in this shithole town."
Cue_E5_5C_Street_TruckerSaved_IGE_Trucker_050="And I ain’t never coming back here... You need a lift?"
Cue_E5_5C_Street_TruckerSaved_IGE_Trucker_070="You go, girl. You go."
